Конфигурация/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекОпт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекОптБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекРозница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекРозницаБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПроизводитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МІСТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтоимостьЗаправкиШинАзотом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьЗаправкиШинАзотом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Закупка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диаметр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтоимостьПрокаткиДисков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьПрокаткиДисков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеталПродажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеталЗакупка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитыеПродажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитыеЗакупка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диаметр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/CommonModules/Гараж/Ext/Module.bsl
Процедура ВыбратьАдресДоставкиПеремещение(СтандартнаяОбработка, ЭтаФорма, ДокументОбъект) Экспорт
	  
	  СтандартнаяОбработка = Ложь;
	  КонтрагентДокумент = ДокументОбъект.КонтрагентЗПок;
	  Если НЕ КонтрагентДокумент.Пустая() Тогда
		  ФормаВыбора = РегистрыСведений.КонтактнаяИнформация.ПолучитьФормуСписка("ФормаСписка", ЭтаФорма);
		  ФормаВыбора.РежимВыбора = Истина;
		  ФормаВыбора.мВозвратДанныхКонтактнойИнформации = Истина;
		  
		  ФормаВыбора.РегистрСведенийСписок.Отбор.Объект.Значение = КонтрагентДокумент;
		  ФормаВыбора.РегистрСведенийСписок.Отбор.Объект.Использование = Истина;
		  
		  СтруктураОтбораАдресов = Новый СписокЗначений;
		  СтруктураОтбораАдресов.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
		  ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.ВидСравнения = ВидСравнения.ВСписке;
		  ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.Значение = СтруктураОтбораАдресов;
		  ФормаВыбора.РегистрСведенийСписок.Отбор.Тип.Использование = Истина;
		  ФормаВыбора.ЭлементыФормы.РегистрСведенийСписок.Колонки.Тип.Видимость = Ложь;
		  
		  СтруктураАдреса = ФормаВыбора.ОткрытьМодально();
		  
		  // Устанавливаем адрес доставки и его комментарий
		  Если СтруктураАдреса <> Неопределено Тогда
			  
			  ДокументОбъект.АдресДоставки1 = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(СтруктураАдреса);
			  
		  КонецЕсли;
		  
	  КонецЕсли;
	  
  КонецПроцедуры
  
  Процедура ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	  //пОПЫТКА
	  //	//	Если (ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента", Источник.Метаданные())) тогда
	  //	//  	  Если Не Источник.ДоговорКонтрагента.Пустая() тогда
	  //	//  		  Если 	Не(Источник.ОтражатьВУправленческомУчете = Ложь и Источник.ОтражатьВБухгалтерскомУчете = Истина) Тогда
	  //	//  			  Если Источник.ДоговорКонтрагента.Форма = Перечисления.ФормыДокументов.IФорма Тогда
	  //	//  				  Источник.ОтражатьВУправленческомУчете = Истина;
	  //	//  				  Источник.ОтражатьВБухгалтерскомУчете = Истина;
	  //	//  			  Иначе
	  //	//  				  Источник.ОтражатьВУправленческомУчете = Истина;
	  //	//  				  Источник.ОтражатьВБухгалтерскомУчете = Ложь;
	  //	//  			  КонецЕслИ;
	  //	//  		  конецесли;
	  //	//  	  КонецЕслИ;
	  //	//  	  
	  //	//	КонецЕслИ;	
	  //	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") или  ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
	  //  	  Если Источник.Организация = Справочники.Организации.НайтиПоКоду("000000001").Ссылка Тогда
	  //  		  Если Источник.ОтражатьВУправленческомУчете = Ложь и Источник.ОтражатьВБухгалтерскомУчете = Истина Тогда 
	  //  		  Иначе
	  //  			  Источник.ОтражатьВУправленческомУчете = Истина;
	  //  			  Источник.ОтражатьВБухгалтерскомУчете = Истина;
	  //  		  КонецЕсли;
	  //  	  Иначе
	  //  		  Источник.ОтражатьВУправленческомУчете = Истина;
	  //  		  Источник.ОтражатьВБухгалтерскомУчете = ЛОЖЬ;
	  //  	  КонецЕсли;
	  //	Иначе
	  //  	  Источник.ОтражатьВУправленческомУчете = Истина;
	  //  	  Источник.ОтражатьВБухгалтерскомУчете = ЛОЖЬ;
	  //  	  
	  //	КонецЕслИ; 
	  //	//	Источник.Записать();
	  //Исключение
	  //	
	  //КонецПопытки;
	  //  
	  Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КорректировкаДолга")тогда
		  Возврат;
	  КонецЕсли;
	  
	  Если Источник.ЭтоНовый() Тогда
   Попытка
	   Если Источник.Организация = Справочники.Организации.НайтиПоКоду("000000001").Ссылка Тогда//FOFA
		   Источник.ОтражатьВУправленческомУчете = Истина;
		   Источник.ОтражатьВБухгалтерскомУчете = Истина;
	   Иначе
		   Источник.ОтражатьВУправленческомУчете = Истина;
		   Источник.ОтражатьВБухгалтерскомУчете = Ложь;
	   КонецЕслИ;   
		//+БП: d.matyash (03.12.2024) <> 
		БП_ОбщийМодуль.ИзменитьОрганизацию(Источник, Ложь,Истина,Истина);	    				
		//-БП: d.matyash (03.12.2024) <>
   Исключение
   КонецПопытки;
   КонецЕслИ;
	  
  КонецПроцедуры
  
  
  Процедура СнятьРезерв() Экспорт
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ЗакрытиеЗаказовПокупателей.Ссылка
	  |ИЗ
	  |	Документ.ОтменаЗаказовПокупателей КАК ЗакрытиеЗаказовПокупателей
	  |ГДЕ
	  |	ЗакрытиеЗаказовПокупателей.Дата МЕЖДУ &Начало И &Конец
	  |	И ЗакрытиеЗаказовПокупателей.Проведен = Истина";
	  Запрос.УстановитьПараметр("Начало",НачалоДня(ТекущаяДата()));
	  Запрос.УстановитьПараметр("Конец",КонецДня(ТекущаяДата()));
	  Результат = Запрос.Выполнить().Выбрать();
	  Стат = Истина;
	  Пока Результат.Следующий() Цикл
		  Стат = Ложь;
		  Прервать;
	  КонецЦикла;
	  Если Стат Тогда
		  ДокСнятия = Документы.ОтменаЗаказовПокупателей.СоздатьДокумент();
		  ДокСнятия.Дата = ТекущаяДата();
		  ДокСнятия.Ответственный = глЗначениеПеременной("глТекущийПользователь");
		  ДокСнятия.ЗаполнитьЗаказы();
		  ДокСнятия.Записать(РежимЗаписиДокумента.Проведение);

#Если Клиент Тогда
		  
		  Сообщить("Сняли проссроченый резерв: "+ДокСнятия);
		  #КонецЕсли

	  КонецЕсли;
  КонецПроцедуры
  
  
  Процедура 	СнимемЗаказПоставщику(З,С);
	  Запрос = Новый ЗАпрос;
	  ЗАпрос.Текст = "ВЫБРАТЬ
	  |	ЗаказПоставщикуТовары.Ссылка
	  |ИЗ
	  |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	  |ГДЕ
	  |	ЗаказПоставщикуТовары.Заказ = &Заказ
	  |	И ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления = Ложь
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ЗаказПоставщикуТовары.Ссылка";
	  Запрос.УстановитьПараметр("Заказ",З);
	  Р = Запрос.Выполнить().Выбрать();
	  Пока Р.Следующий() Цикл
		  ЗП = Р.Ссылка.ПолучитьОбъект();
		  Зп.СтатусЗП = С;
		  ЗП.ЗАписать(РежимЗаписиДокумента.ОтменаПроведения);
	  КонецЦикла;
	  
  КонецПроцедуры
  
  Процедура 	СнимемПеремещение(З,С);
	  Запрос = Новый ЗАпрос;
	  ЗАпрос.Текст = "ВЫБРАТЬ
	  |	ПеремещениеТоваров.Ссылка
	  |ИЗ
	  |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	  |ГДЕ
	  |	ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ
	  |	И ПеремещениеТоваров.ПометкаУдаления = Ложь
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ПеремещениеТоваров.Ссылка";
	  Запрос.УстановитьПараметр("Заказ",З);
	  Р = Запрос.Выполнить().Выбрать();
	  Пока Р.Следующий() Цикл
		  ЗП = Р.Ссылка.ПолучитьОбъект();
		  Зп.Статус = С;
		  ЗП.ЗАписать(РежимЗаписиДокумента.ОтменаПроведения);
	  КонецЦикла;
	  
  КонецПроцедуры
  
  Функция ЕстьВЭкспедиторке(П)
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ЭкспедиторкаДокументыТ.Ссылка
	  |ИЗ
	  |	Документ.Экспедиторка.ДокументыТ КАК ЭкспедиторкаДокументыТ
	  |ГДЕ
	  |	ЭкспедиторкаДокументыТ.Документ = &Док
	  |	И ЭкспедиторкаДокументыТ.Ссылка.ПометкаУдаления = Ложь";
	  Запрос.УстановитьПараметр("Док",П);
	  Р = ЗАпрос.Выполнить().Выбрать();
	  Пока Р.Следующий() Цикл
		  Возврат ИстинА;
	  КонецЦикла;
	  Возврат Ложь;
  КонецФункции
  
  
  Процедура ОтменаЗаказа(Заказ)     Экспорт
#Если Клиент Тогда	  
	  Режим = РежимДиалогаВопрос.ДаНет;
	  Текст = "Произвести отмену заказа № "+Заказ.Номер+" от покупателя "+Заказ.Контрагент;
	  Ответ = Вопрос(Текст, Режим, 0);
	  Если Ответ = КодВозвратаДиалога.Нет Тогда
		  Возврат;
	  КонецЕсли; 
	  Если Не РольДоступна("ПолныеПрава") Тогда
		  Если ЗАказ.Ответственный <> ПараметрыСеанса.ТекущийПользователь Тогда
			  Предупреждение("Нет доступа для отмены заказа!");
			  Возврат;
		  КонецЕслИ;
	  КонецЕслИ;
	  
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ЗаказыПокупателейОстатки.КоличествоОстаток,
	  |	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	  |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовПриход, 0) КАК Поле1,
	  |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход, 0) КАК Поле2
	  |ИЗ
	  |	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя = &Заказ) КАК ЗаказыПокупателейОстатки
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты КАК ВзаиморасчетыСКонтрагентамиОбороты
	  |		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ВзаиморасчетыСКонтрагентамиОбороты.Сделка";
	  ЗАпрос.УстановитьПараметр("Заказ",Заказ);
	  ЗапросРн = Новый Запрос;
	  ЗапросРН.Текст = "ВЫБРАТЬ
	  |	РеализацияТоваровУслуг.Ссылка
	  |ИЗ
	  |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	  |ГДЕ
	  |	РеализацияТоваровУслуг.Проведен = ИСТИНА
	  |	И РеализацияТоваровУслуг.Сделка = &Заказ";
	  
	  Рез = ЗАпрос.Выполнить().Выбрать();
	  МожноСнимать = Истина;
	  Пока Рез.Следующий() Цикл
		  если Рез.ЗаказПокупателя.Статус <> Справочники.Статусы.Создан и ЗначениеЗаполнено(Рез.ЗаказПокупателя.Статус) Тогда
			  МожноСнимать = Ложь;
		  КонецеслИ;
		  Если Рез.Поле1 <> 0 или Рез.Поле2 <> 0 Тогда
			  МожноСнимать = Ложь;
		  КонецЕсли;
		  ЗапросРН.УстановитьПараметр("Заказ",Рез.ЗаказПокупателя);
		  РезРн = ЗапросРн.Выполнить().Выбрать();
		  ЕстьРН = Ложь;
		  Пока РезРн.Следующий() Цикл
			  ЕстьРН = Истина;
			  МожноСнимать = Ложь;
		  КонецЦикла;
		  Если МожноСнимать Тогда
			  //1 Пункт
			  Запрос = Новый Запрос;
			  Запрос.Текст = "ВЫБРАТЬ
			  |	ПоступлениеТоваровУслугТовары.Ссылка
			  |ИЗ
			  |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			  |ГДЕ
			  |	ПоступлениеТоваровУслугТовары.Заказ = &Заказ
			  |	И ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления = Ложь";
			  ЗАпрос.УстановитьПараметр("Заказ",Заказ);
			  Рез = Запрос.Выполнить().Выбрать();
			  Продолжаем = Истина;
			  Пока Рез.Следующий() Цикл
				  З = Заказ.ПолучитьОбъект();
				  З.Статус = Справочники.Статусы.НайтиПоКоду("000000007");
				  З.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				  Продолжаем = Ложь;
			  КонецЦикла;
			  Если НЕ Продолжаем Тогда
				  Возврат;
			  КонецЕсли;
			  //2 Пункт
			  Запрос = Новый Запрос;
			  Запрос.Текст = "ВЫБРАТЬ
			  |	ПеремещениеТоваров.Ссылка
			  |ИЗ
			  |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			  |ГДЕ
			  |	ПеремещениеТоваров.ПометкаУдаления = Ложь
			  |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ";
			  ЗАпрос.УстановитьПараметр("Заказ",Заказ);
			  
			  Рез = Запрос.Выполнить().Выбрать();
			  Продолжаем = Истина;
			  ЕстьПеремещение = Ложь;
			  Пока Рез.Следующий() Цикл
				  ЕстьПеремещение = Истина;
			  КонецЦикла;
			  Если Не ЕстьПеремещение Тогда
				  З = Заказ.ПолучитьОбъект();
				  З.Статус = Справочники.Статусы.НайтиПоКоду("000000007");
				  З.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				  Продолжаем = Ложь;
				  СнимемЗаказПоставщику(Заказ,Справочники.Статусы.НайтиПоКоду("000000010").Ссылка);
			  КонецЕсли;				
			  
			  Если НЕ Продолжаем Тогда
				  Возврат;
			  КонецЕсли;
			  
			  //2_2 Пункт
			  Запрос = Новый Запрос;
			  Запрос.Текст = "ВЫБРАТЬ
			  |	ПеремещениеТоваров.Ссылка
			  |ИЗ
			  |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			  |ГДЕ
			  |	ПеремещениеТоваров.ПометкаУдаления = Ложь
			  |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ";
			  ЗАпрос.УстановитьПараметр("Заказ",Заказ);
			  
			  Рез = Запрос.Выполнить().Выбрать();
			  Продолжаем = Истина;
			  ЕстьПеремещение = Ложь;
			  Пока Рез.Следующий() Цикл
				  Если Не ЕстьВЭкспедиторке(Рез.Ссылка) Тогда
					  З = Заказ.ПолучитьОбъект();
					  З.Статус = Справочники.Статусы.НайтиПоКоду("000000007");
					  З.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					  Продолжаем = Ложь;
					  СнимемЗаказПоставщику(Заказ,Справочники.Статусы.НайтиПоКоду("000000010").Ссылка);
					  СнимемПеремещение(Заказ,Справочники.Статусы.НайтиПоКоду("000000014").Ссылка);
					  
				  КонецЕслИ;
			  КонецЦикла;
			  
			  Если НЕ Продолжаем Тогда
				  Возврат;
			  КонецЕсли;
			  
			  //3 пункт
			  Запрос = Новый Запрос;
			  Запрос.Текст = "ВЫБРАТЬ
			  |	ПеремещениеТоваров.Ссылка
			  |ИЗ
			  |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			  |ГДЕ
			  |	ПеремещениеТоваров.ПометкаУдаления = ЛОЖЬ
			  |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ
			  |	И ПеремещениеТоваров.Статус <> &Выполнено";
			  ЗАпрос.УстановитьПараметр("Заказ",Заказ);
			  ЗАпрос.УстановитьПараметр("Выполнено",Справочники.Статусы.НайтиПоКоду("000000016").Ссылка);
			  
			  Рез = Запрос.Выполнить().Выбрать();
			  Продолжаем = Истина;
			  ЕстьПеремещение = Ложь;
			  Пока Рез.Следующий() Цикл
				  Если ЕстьВЭкспедиторке(Рез.Ссылка) Тогда
					  З = Заказ.ПолучитьОбъект();
					  З.Статус = Справочники.Статусы.НайтиПоКоду("000000009");
					  З.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					  Продолжаем = Ложь;
					  //СнимемЗаказПоставщику(Заказ,Справочники.Статусы.НайтиПоКоду("000000010").Ссылка);
					  СнимемПеремещение(Заказ,Справочники.Статусы.НайтиПоКоду("000000012").Ссылка);
					  Предупреждение("По данному заказу покупателя есть транзитное перемещение, которое включено в маршрутный лист! Обратитесь к администратору отгрузок. Заказ покупателя будет переведен в статус «К отмене».");
				  КонецЕслИ;
			  КонецЦикла;
			  
			  Если НЕ Продолжаем Тогда
				  Возврат;
			  КонецЕсли;
			  
			  //4 пункт
			  Запрос = Новый Запрос;
			  Запрос.Текст = "ВЫБРАТЬ
			  |	ПеремещениеТоваров.Ссылка
			  |ИЗ
			  |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			  |ГДЕ
			  |	ПеремещениеТоваров.ПометкаУдаления = ЛОЖЬ
			  |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ
			  |	И ПеремещениеТоваров.Статус = &Выполнено";
			  ЗАпрос.УстановитьПараметр("Заказ",Заказ);
			  ЗАпрос.УстановитьПараметр("Выполнено",Справочники.Статусы.НайтиПоКоду("000000016").Ссылка);
			  
			  Рез = Запрос.Выполнить().Выбрать();
			  Продолжаем = Истина;
			  ЕстьПеремещение = Ложь;
			  Пока Рез.Следующий() Цикл
				  Если ЕстьВЭкспедиторке(Рез.Ссылка) Тогда
					  З = Заказ.ПолучитьОбъект();
					  З.Статус = Справочники.Статусы.НайтиПоКоду("000000007");
					  З.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					  Продолжаем = Ложь;
				  КонецЕслИ;
			  КонецЦикла;
			  
			  Если НЕ Продолжаем Тогда
				  Возврат;
			  КонецЕсли;
			  
			  
			  
		  Иначе
			  Предупреждение("Заказ не получится снять автоматически");
		  КонецЕслИ;
	  КонецЦикла;
	  #КонецЕсли

  КонецПроцедуры
  
  Функция ВыбратьПартию(Номенклатура,Дата,Организация,Склад) Экспорт
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.ДокументОприходования Как Партия,
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.КоличествоОстаток Как Количество,
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.СтоимостьОстаток Как Стоимость
	  |ИЗ
	  |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	  |			&Момент,
	  |			Номенклатура = &Номенклатура
	  |				И Склад = &Склад) КАК ПартииТоваровНаСкладахНалоговыйУчетОстатки";
	  Запрос.УстановитьПараметр("Момент",КонецДня(Дата));
	  Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	  Запрос.УстановитьПараметр("Организация",Организация);
	  Запрос.УстановитьПараметр("Склад",Склад);
	  Результат = Запрос.Выполнить().Выгрузить().ВыбратьСтроку("Выберите партию").Партия;
	  Возврат Результат;
  КонецФункции
  
  Процедура ПлановыеОстатки(Ск) Экспорт
	  //Запрос = Новый Запрос;
	  //Запрос.Текст = "ВЫБРАТЬ
	  //			   |	СЗакрытиеЗаказовПокупателей.Ссылка
	  //			   |ИЗ
	  //			   |	Документ.ЗаказПоставщику КАК ЗакрытиеЗаказовПокупателей
	  //			   |ГДЕ
	  //			   |	ЗакрытиеЗаказовПокупателей.Дата МЕЖДУ &Начало И &Конец
	  //			   |	И ЗакрытиеЗаказовПокупателей.Создал = &Закупка
	  //			   |	И ЗакрытиеЗаказовПокупателей.ПометкаУдаления = Ложь";
	  //Запрос.УстановитьПараметр("Начало",НачалоДня(ТекущаяДата()));
	  //Запрос.УстановитьПараметр("Конец",КонецДня(ТекущаяДата()));
	  //Запрос.УстановитьПараметр("Закупка",Справочники.Пользователи.НайтиПоКоду("Администратор"));
	  //
	  //Результат = Запрос.Выполнить().Выбрать();
	  Стат = Истина;
	  //Пока Результат.Следующий() Цикл
	  //	Стат = Ложь;
	  //	Прервать;
	  //КонецЦикла;
	  Если Стат Тогда
		  Запрос = Новый Запрос;
		  Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                 |	ПлановыеОстаткиТоваров.Ссылка
		                 |ИЗ
		                 |	Документ.ПлановыеОстаткиТоваров КАК ПлановыеОстаткиТоваров
		                 |ГДЕ
		                 |	ПлановыеОстаткиТоваров.Проведен = ИСТИНА
		                 |	И ПлановыеОстаткиТоваров.Склад = &Склад
		                 |
		                 |УПОРЯДОЧИТЬ ПО
		                 |	ПлановыеОстаткиТоваров.Дата УБЫВ";
						 Запрос.УстановитьПараметр("Склад",Ск);
		  Рез = Запрос.Выполнить().Выбрать();
		  Табличка = Новый ТаблицаЗначений;
		  Табличка.Колонки.Добавить("Номенклатура");
		  Табличка.Колонки.Добавить("План");
		  Табличка.Колонки.Добавить("Факт");
		  Запрос = Новый Запрос;
		  Запрос.Текст = "ВЫБРАТЬ
		                 |	ТоварыНаСкладахОстатки.Номенклатура,
		                 |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК Поле1
		                 |ИЗ
		                 |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Ск) КАК ТоварыНаСкладахОстатки
		                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Ск) КАК ТоварыВРезервеНаСкладахОстатки
		                 |		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ТоварыНаСкладахОстатки.Номенклатура";
				Запрос.УстановитьПараметр("Ск",Ск);
		  Остатки = Запрос.Выполнить().Выбрать();
		  Пока Рез.Следующий() Цикл
			  ДокПлан = Рез.Ссылка;
			  Для Каждого Стр из ДокПлан.Номенклатура Цикл
				  Ст = Табличка.Добавить();
				  Ст.Номенклатура = Стр.Товар;
				  Ст.План = Стр.МинимальныйОстаток;
				  Ст.Факт = 0;
			  КонецЦикла;
		  КонецЦикла;
		  Табличка.Свернуть("Номенклатура","План,Факт");
		  Для каждого Стр Из Табличка Цикл
			  Остатки.Сбросить();
			  Струк = Новый Структура;
			  Струк.Вставить("Номенклатура",Стр.Номенклатура);
			  пока Остатки.НайтиСледующий(Струк) Цикл
				  Стр.Факт = Остатки.Поле1;
			  КонецЦикла;
		  КонецЦикла;
		  
		  Заказ = Документы.ЗаказПоставщику.СоздатьДокумент();
		  Заказ.Дата = ТекущаяДата();
		  Заказ.КратностьВзаиморасчетов = 1;
		  Заказ.КурсВзаиморасчетов = 1;
		  Заказ.Организация = Справочники.Организации.НайтиПоКоду("000000002").Ссылка;
		  Заказ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		  Заказ.Создал = Справочники.Пользователи.НайтиПоКоду("Администратор");
		  Заказ.ДатаСоздания = ТекущаяДата();
		  Заказ.СуммаВключаетНДС = Истина;
		  Заказ.УчитыватьНДС = Ложь;
		  Заказ.УсловиеПоставки = Справочники.УсловияПоставки.Самовывоз;
		  Заказ.Комментарий = "Плановая закупка";
		  Заказ.Склад = Ск;
		  Для Каждого Строка Из Табличка Цикл
			  если Строка.План - строка.Факт >0 Тогда
			  Стр = Заказ.Товары.Добавить();
			  Стр.ЕдиницаИзмерения = Строка.Номенклатура.ЕдиницаХраненияОстатков;
			  Стр.Количество = Строка.План - строка.Факт;
			  Стр.Коэффициент = 1;
			  Стр.Номенклатура = Строка.Номенклатура;
			  Стр.СтавкаНДС = перечисления.СтавкиНДС.БезНДС;
			  УКогоТовар = УКого(Стр);
			  конецЕслИ;
		  КонецЦикла;
		  если Заказ.Товары.Количество()>0 тогда
			  Заказ.Записать();

#Если Клиент Тогда
			  
			  Сообщить("Сформировали плановую закупку товаров: "+Заказ);
#КонецЕсли
			  
		  конецЕсли;
	  КонецЕсли;
  КонецПроцедуры
  
Функция УКого(Ном)
	 Запрос = Новый запрос; 
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен.Владелец КАК Владелец,
	                |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Поле1
	                |ИЗ
	                |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, Номенклатура = &Ном) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	                |		ПО ЦеныНоменклатурыКонтрагентовСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Поле1";
	Запрос.УстановитьПараметр("Ном",Ном.Номенклатура);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		Попытка
		Если Рез.Поле1 < 4 Тогда
			Продолжить;
		КонецЕслИ;
	Исключение
		Продолжить;
		КонецПопытки ;
		Ном.Цена = Рез.Поле1;
		Ном.Поставщик = Рез.Владелец;
		Ном.Сумма = Ном.Цена * Ном.Количество;
		ПрерватЬ;
	КонецЦикла;
КонецФункции

Процедура ПередЗаписьюННПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Не Источник.контрагент.ИнформацияПроверена Тогда
		#Если Клиент Тогда
			
			Сообщить("Информация по контрагенту не проверена, зайдите в карточку контрагента и нажмите галочку Информация проверена",СтатусСообщения.Важное);
			Отказ = Истина;
		#КонецЕсли
	КонецЕслИ;
КонецПроцедуры

Процедура УдалитьСтаруюНоменклатуруПоставщика() Экспорт
	// Вставить содержимое обработчика.
	Цены = Документы.УстановкаЦенНоменклатурыКонтрагентов.Выбрать(,ТекущаяДата()-30*24*60*60);
	Пока Цены.Следующий() Цикл
		Если Не Цены.Проведен и НЕ Цены.ПометкаУдаления Тогда
			Ц = Цены.ПолучитьОбъект();
			Ц.УстановитьПометкуУдаления(Истина);
		КонецЕслИ;
	КонецЦикла;
	ЗАпрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура,
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка,
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.НоменклатураПоставщика
	|ИЗ
	|	Документ.УстановкаЦенНоменклатурыКонтрагентов.Товары КАК УстановкаЦенНоменклатурыКонтрагентовТовары
	|ГДЕ
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка.Дата > &ДатаСтарта
	|	И НЕ УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДатаСтарта",ТекущаяДата()-30*24*60*60);
	Рез = Запрос.Выполнить().Выбрать();
	НП = Справочники.НоменклатураПоставщика.Выбрать();
	Пока нп.Следующий() Цикл
		Если ЗначениеЗаполнено(Нп.Номенклатура) Тогда
			Продолжить;
		КонецЕслИ;
		Если Нп.ПометкаУдаления Тогда
			Продолжить;
		КонецЕслИ;
		Рез.Сбросить();
		Струк = Новый Структура;
		Струк.Вставить("НоменклатураПоставщика",Нп.Ссылка);
		Нашли = Ложь;
		Пока Рез.НайтиСледующий(Струк) Цикл
			Нашли = Истина;
		КонецЦикла;
		Если НЕ НАшли Тогда
			Н = Нп.ПолучитьОбъект();
			Н.УстановитьПометкуУдаления(ИСтина)
		КонецЕслИ;
	КонецЦикла;
КонецПроцедуры

Процедура ЗарузитьПредЗказы() Экспорт
	//ЗаписьЖурналаРегистрации("Импорт заказов в 1с",УровеньЖурналаРегистрации.Информация,,,"Импорт заказов в 1с"); //bsoft (21.08.2024)
	
	
	КаталогНаСервере = "/1c/garazh_emails/";
	Адрессайта = "88.218.28.163";//"185.156.42.204";
	Логин = "ftp-garazh";
	Пароль = "t46KlF81m";
	
	//    Попытка
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,2000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	
	//ФайлЗаказы = "D:\order.csv";
	
	НайдФ=Сайт.НайтиФайлы(Сайт.ТекущийКаталог(),"*.*",Истина);
	Если НайдФ.Количество()>0 Тогда
		Для каждого Ф из НайдФ Цикл
			//Если ф.имя = "Goods1c.csv" Тогда
			//	Продолжить;
			//КонецЕслИ;
			//ЗаписьЖурналаРегистрации("Импорт заказов в 1с "+Строка(Ф.Имя),УровеньЖурналаРегистрации.Информация,,,"Импорт заказов в 1с"+Строка(Ф.Имя)); //bsoft (21.08.2024)
			
			Сайт.Получить(Ф.пОЛНОЕИмя,"c:\Temp\order.txt"); 
			Пред = Документы.ПредЗаказ.СоздатьДокумент();
			Пред.Дата = ТекущаяДата();  
			
			НП_APIКлюч = МодульНовойПошты_СД.ПолучитьAPIКлючПоДате(Пред.Дата);
			Если не НП_APIКлюч = "" Тогда
				НастройкиAPIКлюча = МодульНовойПошты_СД.ПолучитьНастройкиПоAPIКлючу(НП_APIКлюч);
				Если Не НастройкиAPIКлюча = Неопределено Тогда
					Пред.НП_КонтрольОплаты = НастройкиAPIКлюча.НП_КонтрольОплаты;				
				КонецЕсли;
			КонецЕсли;
			
			пред.Статус = Справочники.Статусы.НайтиПоКоду("000000055");
			пРЕД.ВремяПоступленияЗаявки = тЕКУЩАЯдАТА();
			Текст = Новый ТекстовыйДокумент;
			Текст.Прочитать("c:\Temp\order.txt","UTF-8");
			//;
			Пред.Комментарий = Текст.ПолучитьТекст();
			ТекНомМенеджер = константы.ТекущийМенелдер.Получить();
			Константы.ТекущийМенелдер.Установить(ТекНомМенеджер+1);
			Мен = Константы.ТекущийМенелдер.Получить();
			Док = Документы.ГрафикРаботыМенеджеров.Выбрать(ТекущаяДата()-30*24*60*60,ТекущаяДата()+30*24*60*60);
			Пока Док.Следующий() Цикл
				Если Док.Проведен Тогда
					Если Док.ДатаПо >= ТекущаяДата() и Док.Дата <= ТекущаяДата()  Тогда
						
						Кво = Док.Менеджера.Количество();
						Поз = Мен-Цел(Мен/Кво)*Кво;
						Если Поз = 0 Тогда
							Поз = Кво;
						КонецЕсли; 
						Пред.Ответственный = Док.Менеджера.Получить(Поз-1).Менеджер;
						Пред.ОтветственныйМенеджер = Док.Менеджера.Получить(Поз-1).Менеджер;
						
						ПрерватЬ;
					КонецЕсли; 
				КонецЕсли; 	
			КонецЦикла; 
			Пред.Организация = Справочники.Организации.НайтиПоКоду("000000003"); 
			
			Попытка
				ЗаполнитьДопУслугиПредЗаказа(Пред);
			Исключение КонецПопытки;
			Пред.Записать();
			//Сайт.Получить(ф.имя,"c:\Temp\Orders\"+ф.имя); 
			 //сООБЩИТЬ(Ф.ИМЯ);
			//ЗагрузитЗаказ("c:\Temp\order.XML");
			//  ПрерватЬ;
			Попытка
			Сайт.Удалить(КаталогНаСервере,Ф.Имя);//пока убрал, потом поставить в рабочей
			//ЗаписьЖурналаРегистрации("Импорт заказов в 1с(Удаление файла из сайта) "+Строка(Ф.Имя),УровеньЖурналаРегистрации.Информация,,,"Импорт заказов в 1с"+Строка(Ф.Имя)); //bsoft (21.08.2024)
		Исключение
			КонецПопытки;
		КонецЦикла    
	КонецЕсли;

КонецПроцедуры    

//с.д.(
Процедура ЗаполнитьДопУслугиПредЗаказа(Пред)Экспорт 
	КвоШин = 0;
	КвоДисков = 0;
	Диам = 0;

	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000001886").Ссылка;//Шиномонтаж
	СтДоп.Количество = 1;
	Покупка = 0;
	Продажа = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтоимостьШиномонтажа.Закупка,
	               |	СтоимостьШиномонтажа.Продажа
	               |ИЗ
	               |	РегистрСведений.СтоимостьШиномонтажа КАК СтоимостьШиномонтажа
	               |ГДЕ
	               |	СтоимостьШиномонтажа.Диаметр = &Диаметр
	               |	И СтоимостьШиномонтажа.Внедорожник = Ложь";
	Запрос.УстановитьПараметр("Диаметр",Диам);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
	Покупка = Рез.Закупка;
	Продажа = Рез.Продажа;
	КонецЦикла;
	СтДоп.СуммаПродажи = Продажа;
	СтДоп.СуммаЗакупки = Покупка;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000022193").Ссылка;//Заправка азотом
	СтДоп.Количество = 1;
	Покупка = 0;
	Продажа = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтоимостьЗаправкиШинАзотом.Закупка,
	               |	СтоимостьЗаправкиШинАзотом.Продажа
	               |ИЗ
	               |	РегистрСведений.СтоимостьЗаправкиШинАзотом КАК СтоимостьЗаправкиШинАзотом
	               |ГДЕ
	               |	СтоимостьЗаправкиШинАзотом.Диаметр = &Диаметр";
	Запрос.УстановитьПараметр("Диаметр",Диам);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
	Покупка = Рез.Закупка;
	Продажа = Рез.Продажа;
	КонецЦикла;
	СтДоп.СуммаПродажи = Продажа;
	СтДоп.СуммаЗакупки = Покупка;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00000019323").Ссылка;//Доствка
	СтДоп.Количество = 1;
	Если КвоШин + КвоДисков <= 2 Тогда
	СтДоп.СуммаПродажи = 350;
	СтДоп.СуммаЗакупки = 100;
	Иначе
	СтДоп.СуммаПродажи = 350;
	СтДоп.СуммаЗакупки = 100;
	конецЕслИ;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000013600").Ссылка;//Хранение
	СтДоп.Количество = 1;
	СтДоп.СуммаПродажи = 299;
	СтДоп.СуммаЗакупки = 50;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000024342").Ссылка;//Пакети
	СтДоп.Количество = КвоШин;
	СтДоп.СуммаПродажи = КвоШин * 7.5;
	СтДоп.СуммаЗакупки = КвоШин * 1.8;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00000022384").Ссылка;//Вентилі
	СтДоп.Количество = Макс(КвоШин,квоДисков);
	СтДоп.СуммаПродажи = Макс(КвоШин,квоДисков) * 10;
	СтДоп.СуммаЗакупки = Макс(КвоШин,квоДисков) * 4.5;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000011749").Ссылка;//Вентиль дорогий
	СтДоп.Количество = Макс(КвоШин,квоДисков);
	СтДоп.СуммаПродажи = Макс(КвоШин,квоДисков) * 35;
	СтДоп.СуммаЗакупки = Макс(КвоШин,квоДисков) * 7;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000015731").Ссылка;//Ошиповка
	СтДоп.Количество = КвоШин;
	СтДоп.СуммаПродажи = 0;
	СтДоп.СуммаЗакупки = 0;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000012937").Ссылка;//Прокатка
	СтДоп.Количество = Макс(КвоШин,квоДисков);
	Покупка = 0;
	Продажа = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтоимостьПрокаткиДисков.МеталПродажа,
	               |	СтоимостьПрокаткиДисков.МеталЗакупка,
	               |	СтоимостьПрокаткиДисков.ЛитыеПродажа,
	               |	СтоимостьПрокаткиДисков.ЛитыеЗакупка
	               |ИЗ
	               |	РегистрСведений.СтоимостьПрокаткиДисков КАК СтоимостьПрокаткиДисков
	               |ГДЕ
	               |	СтоимостьПрокаткиДисков.Диаметр = &Диаметр";
	Запрос.УстановитьПараметр("Диаметр",Диам);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
	Покупка = Рез.ЛитыеЗакупка;
	Продажа = Рез.ЛитыеПродажа;
	КонецЦикла;
	СтДоп.СуммаПродажи = Макс(КвоШин,квоДисков) * Продажа;
	СтДоп.СуммаЗакупки = Макс(КвоШин,квоДисков) * Покупка;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	
	
	СтДоп = Пред.ДополнительныеУслуги.Добавить();
	СтДоп.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Г0000013601").Ссылка;//Прокатка метал
	СтДоп.Количество = Макс(КвоШин,квоДисков);
	Покупка = 0;
	Продажа = 0;
	Рез.Сбросить();
	Пока Рез.Следующий() Цикл
	Покупка = Рез.МеталЗакупка;
	Продажа = Рез.МеталПродажа;
КонецЦикла;

	
	СтДоп.СуммаПродажи = Макс(КвоШин,квоДисков) * Продажа;
	СтДоп.СуммаЗакупки = Макс(КвоШин,квоДисков) * Покупка;
	Если СтДоп.Количество <> 0 Тогда
		СтДоп.ЦенаПродажи = СтДоп.СуммаПродажи / СтДоп.Количество;
		СтДоп.ЦенаЗакупки = СтДоп.СуммаЗакупки / СтДоп.Количество;
	КонецЕслИ;
	
	//если ЭлементыФормы.Организация.Значение.Код = "000000001" Тогда
	//	Для каждого Стр из Пред.ДополнительныеУслуги Цикл
	//		Стр.СуммаПродажи = Стр.СуммаПродажи * 1.20;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры
//с.д.)

Процедура ПередЗаписьюДокументаПередЗаписью1(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставити вміст обробника.
	#Если Клиент Тогда
		Если Не РольДоступна("ПолныеПрава") Тогда
		Если Источник.Ссылка.ПометкаУдаления = Ложь И Источник.ПометкаУдаления = Истина Тогда 
			
			Отказ = Истина;
			
		КонецЕсли;		
		КонецЕслИ;
		Попытка
			если ТипЗНЧ(Источник) <>Тип("ДокументОбъект.ЗаказПокупателя") и  ТипЗНЧ(Источник) <>Тип("ДокументОбъект.ЗаказПоставщику") Тогда
				Если Не Рольдоступна("ПолныеПрава") и не РольДоступна("СенсорныйЕкран_Оператор_СД") и не РольДоступна("СенсорныйЕкран_Администратор_СД") Тогда
			Источник.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			КонецЕслИ;
			КонецеслИ;
		Исключение
		КонецПопытки;
	#КонецЕсли	
КонецПроцедуры

Процедура ВыгрузкаЗаказы() Экспорт
	// Вставити вміст обробника.
КонецПроцедуры
